---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementCategoryFilter
source: html/6b8f4e3a-1975-7388-3848-462cf305d523.htm
---
# ElementCategoryFilter Members

Constructs a new instance of a filter to match elements by category.